リストの先頭の要素を取得する
============================

先頭の要素を任意の数だけ取得する
--------------------------------

リストの先頭の要素をひとつだけ取得するには`head`を使います。
`head`は空リストに適用するとエラーになるので注意が必要です。

```haskell
> head [0..5]
0
> head []
*** Exception: Prelude.head: empty list
```

先頭から2つ以上の要素を取得するには`take`を使います。
要素数より多い数を要求した場合は、リスト全体が返ります。

```haskell
> take 2 [0..5]
[0,1]
> take 100 [0..5]
[0,1,2,3,4,5]
```

先頭から条件に合う要素を取得する
--------------------------------

プレディケートを要素に適用し、結果が真である部分を先頭から取得するには`takeWhile`を使います。

5未満の要素を先頭から取得するには、このようにします。

```haskell
> takeWhile (< 5) [2, 4, 1, 0, 5, 1]
[2,4,1,0]
```
