リストの要素を削除する
======================

指定の要素を指定して削除する
----------------------------

指定の要素を削除するには`Data.List`の`delete`を使います。

```haskell
> import Data.List
> delete 5 [0..9]
[0,1,2,3,4,6,7,8,9]
```


先頭のn個の要素を削除する
-------------------------

`drop`は、指定の数だけリストの先頭から要素を削除します。

```haskell
> drop 4 [0..9]
[4,5,6,7,8,9]
```


リスト中のn個の要素を削除する
-----------------------------

`take`と`drop`を使えば、先頭ではなくリストの中から指定した数だけ削除できます。

リストの5番目から2つの要素を削除するにはこのようにします。

```haskell
> let xs = [0..9]
> take 5 xs ++ drop 7 xs
[0,1,2,3,4,7,8,9]
```


条件に合う要素を削除する
----------------------------

`filter`は、条件に合うものだけのリストを返す関数です。
条件を反転させれば条件に合うものを削除することになります。

数値のリストから奇数を削除するにはこのように書きます。
`odd`は、奇数であれば`True`を返す関数です。

```haskell
> filter (not . odd) [0..9]
[0,2,4,6,8]
```

