複数のリストを並行処理する
==========================

ふたつのリストを処理する
------------------------

`zip`を使うとふたつのリストをまとめることができます。

```haskell
> zip [1..3] ['a'..'c']
[(1,'a'),(2,'b'),(3,'c')]
```

引数のリストの長さが異なっていた場合、返り値の長さは短い方に揃えられます。

```haskell
> zip [1..3] ['a'..'z']
[(1,'a'),(2,'b'),(3,'c')]
> zip [1..100] ['a'..'e']
[(1,'a'),(2,'b'),(3,'c'),(4,'d'),(5,'e')]
```

長い方は無限リストでも機能します。

```haskell
> zip [1..3] ['a'..]
[(1,'a'),(2,'b'),(3,'c')]
```

2引数関数を与えてふたつのリストを処理するには`zipWith`が使えます。

```haskell
> zipWith (+) [1, 2, 3] [10, 100, 1000]
[11,102,1003]
> zipWith (&&) [False, False, True, True] [False, True, False, True]
[False,False,False,True]
```

みっつ以上のリストを処理する
----------------------------

みっつ以上のリストをまとめるには`zip3`を使います。
`zip`と同様、引数の長さが異なっている場合は短いものに揃えられます。

```haskell
> zip3 [1..3] ['a'..] [False, True, False, True]
[(1,'a',False),(2,'b',True),(3,'c',False)]
```

4個以上のリストをまとめる関数は`Data.List`をインポートして使うことが出来ます。
`zip4`から`zip7`までの関数が定義されています。

```haskell
> import Data.List
> :t zip4
zip4 :: [a] -> [b] -> [c] -> [d] -> [(a, b, c, d)]
> :t zip7
zip7
  :: [a]
     -> [b]
     -> [c]
     -> [d]
     -> [e]
     -> [f]
     -> [g]
     -> [(a, b, c, d, e, f, g)]
```

同様に`zipWith3`から`zipWith7`も定義されています。
