絶対値を求める
==============

絶対値を求めるには、つぎのように関数absを使います。

```haskell
> abs 8
8
> abs (- 2)
2
> abs 3.5
3.5
> abs (- 1.23)
1.23
```

関数absは、型クラスNumのクラス関数です。

```haskell
> :info abs
class Num a where
  ...
  abs :: a -> a
  ...
        -- Defined in `GHC.Num'
```
